
<img style="float: left;;" src='Figures/alinco.png' height="100"/></a>

# <center> <font color= #000047> DataFrames en Pandas</font> </center>

# DataFrames

Los DataFrames son la principal herramienta de la librería de pandas y se inspiran directamente en el lenguaje de programación R. Podemos pensar en un DataFrame como un grupo de objetos Series juntos para compartir el mismo índice. ¡Usemos pandas para explorar este tema!

In [51]:
# Importar librerías
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0 -0.919085 -2.395291 -1.238445 -0.386999
1 -0.804680  1.581282 -1.293915  0.761547
2 -2.021047 -0.124092  0.894897  0.818909
3 -0.836689  2.180576 -0.561906  0.228333
4 -0.996842 -1.065953  0.931852  0.223360

In [8]:
df[1][3]

2.1805755079529843

In [9]:
ind = 'A B C D E'.split()
ind

['A', 'B', 'C', 'D', 'E']

In [10]:
df = pd.DataFrame(np.random.randn(5,4), index=ind, columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.443908 -0.007780  1.276063  0.613561
B  0.592939 -1.762345 -3.021290  1.012365
C -1.262884 -0.470444  2.212387 -0.869109
D -0.102628  1.328040 -0.901669  0.772350
E -0.844194 -0.365865 -0.064330 -1.417101

## Selección e Indexación

Aprendamos los diversos métodos para obtener datos de un DataFrame

In [11]:
df['W']

A    0.443908
B    0.592939
C   -1.262884
D   -0.102628
E   -0.844194
Name: W, dtype: float64

In [12]:
df.loc['C','X']

-0.47044370054066725

In [13]:
df.iloc[2, 1]

-0.47044370054066725

In [14]:
df[['W','X']]

          W         X
A  0.443908 -0.007780
B  0.592939 -1.762345
C -1.262884 -0.470444
D -0.102628  1.328040
E -0.844194 -0.365865

In [15]:
#Solo funciona cuando las etiquetas no tienen espacio.
df.W

A    0.443908
B    0.592939
C   -1.262884
D   -0.102628
E   -0.844194
Name: W, dtype: float64

In [16]:
df.loc['A',['W', 'Z']]

W    0.443908
Z    0.613561
Name: A, dtype: float64

### Creando una nueva columna:

In [18]:
# Se pueden crear series calculadas
df['new'] = df['X'] - df['Y']
df

          W         X         Y         Z       new
A  0.443908 -0.007780  1.276063  0.613561 -1.283843
B  0.592939 -1.762345 -3.021290  1.012365  1.258945
C -1.262884 -0.470444  2.212387 -0.869109 -2.682831
D -0.102628  1.328040 -0.901669  0.772350  2.229709
E -0.844194 -0.365865 -0.064330 -1.417101 -0.301535

In [20]:
df.drop('new', axis=1, inplace = True)
df

          W         X         Y         Z
A  0.443908 -0.007780  1.276063  0.613561
B  0.592939 -1.762345 -3.021290  1.012365
C -1.262884 -0.470444  2.212387 -0.869109
D -0.102628  1.328040 -0.901669  0.772350
E -0.844194 -0.365865 -0.064330 -1.417101

### Eliminar Columnas

In [19]:
df.drop('new', axis=1)

          W         X         Y         Z
A  0.443908 -0.007780  1.276063  0.613561
B  0.592939 -1.762345 -3.021290  1.012365
C -1.262884 -0.470444  2.212387 -0.869109
D -0.102628  1.328040 -0.901669  0.772350
E -0.844194 -0.365865 -0.064330 -1.417101

también podemos eliminar las columnas de esta forma:

### Seleccionar Columnas

df.loc[]
df.iloc

O seleccionar en base a la posición en vez de alguna etiqueta

### Seleccionar subconjunto de filas y columnas

In [21]:
df.loc[['A','B'], ['X','Y']]

          X         Y
A -0.007780  1.276063
B -1.762345 -3.021290

### Selección condicional

Una característica importante de los pandas es la selección condicional mediante notación de corchetes, muy similar a numpy:

In [22]:
df>0

       W      X      Y      Z
A   True  False   True   True
B   True  False  False   True
C  False  False   True  False
D  False   True  False   True
E  False  False  False  False

In [24]:
#Mostrar todos los elementos mayores a cero.
df[df>0]

          W        X         Y         Z
A  0.443908      NaN  1.276063  0.613561
B  0.592939      NaN       NaN  1.012365
C       NaN      NaN  2.212387       NaN
D       NaN  1.32804       NaN  0.772350
E       NaN      NaN       NaN       NaN

In [25]:
df['W']>0

A     True
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [26]:
df[df['W']>0]

          W         X         Y         Z
A  0.443908 -0.007780  1.276063  0.613561
B  0.592939 -1.762345 -3.021290  1.012365

In [27]:
df[df['W']>0][['W','Z']]

          W         Z
A  0.443908  0.613561
B  0.592939  1.012365

In [29]:
df[(df['W']>0) & (df['Z']>0) ]

          W         X         Y         Z
A  0.443908 -0.007780  1.276063  0.613561
B  0.592939 -1.762345 -3.021290  1.012365

## Más detalles del índice

Analicemos algunas características más de la indexación, incluido el restablecimiento del índice o resetearlo a otro valor. ¡También hablaremos sobre la jerarquía de índices!

In [30]:
df

          W         X         Y         Z
A  0.443908 -0.007780  1.276063  0.613561
B  0.592939 -1.762345 -3.021290  1.012365
C -1.262884 -0.470444  2.212387 -0.869109
D -0.102628  1.328040 -0.901669  0.772350
E -0.844194 -0.365865 -0.064330 -1.417101

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.443908 -0.007780  1.276063  0.613561
1     B  0.592939 -1.762345 -3.021290  1.012365
2     C -1.262884 -0.470444  2.212387 -0.869109
3     D -0.102628  1.328040 -0.901669  0.772350
4     E -0.844194 -0.365865 -0.064330 -1.417101

In [32]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [34]:
df['estados'] = newind
df

          W         X         Y         Z estados
A  0.443908 -0.007780  1.276063  0.613561      CA
B  0.592939 -1.762345 -3.021290  1.012365      NY
C -1.262884 -0.470444  2.212387 -0.869109      WY
D -0.102628  1.328040 -0.901669  0.772350      OR
E -0.844194 -0.365865 -0.064330 -1.417101      CO

In [35]:
df.set_index('estados', inplace=True)
df

                W         X         Y         Z
estados
CA       0.443908 -0.007780  1.276063  0.613561
NY       0.592939 -1.762345 -3.021290  1.012365
WY      -1.262884 -0.470444  2.212387 -0.869109
OR      -0.102628  1.328040 -0.901669  0.772350
CO      -0.844194 -0.365865 -0.064330 -1.417101

## DataFrame Resumen
Hay un par de formas de obtener datos resumidos en DataFrames.<br>
<tt><strong>df.describe()</strong></tt> proporciona estadísticas resumidas en todas las columnas numéricas.<br>
<tt><strong>df.info y df.dtypes</strong></tt> muestra el tipo de datos de todas las columnas.

In [36]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.234572 -0.255679 -0.099768  0.022413
std    0.804920  1.106563  2.025992  1.090743
min   -1.262884 -1.762345 -3.021290 -1.417101
25%   -0.844194 -0.470444 -0.901669 -0.869109
50%   -0.102628 -0.365865 -0.064330  0.613561
75%    0.443908 -0.007780  1.276063  0.772350
max    0.592939  1.328040  2.212387  1.012365

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [39]:
df['W'].dtype

dtype('float64')

# Datos Faltantes (Missing Data)

Mostraremos algunos métodos convenientes para lidiar con los datos faltantes en pandas:

In [41]:
df = pd.DataFrame({'A':[1,2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [43]:
#dropna elimina 
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [45]:
df.dropna(thresh=2) #toma el renglon porque por default el Axis = 0  y quisieramos por columasnentonces ponermos Axis = 1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [46]:
#fillna nos sirve para rellenar los datos nan o vacios.  en este caso estamos rellenado con la media de la columna A
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [47]:
df.fillna(value='unk') #O ponerle un dato para identificar los nulos

     A    B  C
0  1.0  5.0  1
1  2.0  unk  2
2  unk  unk  3

# Groupby

El método groupby nos permite agrupar filas de datos y utilizar funciones de agregación

In [52]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person': ['Sam', 'Charly', 'Amy', 'Vane', 'Carlos', 'Sara'],
       'Sales': [200, 120, 340, 124, 243, 350]}

In [54]:
df = pd.DataFrame(data)
df

  Company  Person  Sales
0    GOOG     Sam    200
1    GOOG  Charly    120
2    MSFT     Amy    340
3    MSFT    Vane    124
4      FB  Carlos    243
5      FB    Sara    350

<strong>Ahora podemos utilizar el método .groupby () para agrupar filas en función del nombre de una columna. <br> Por ejemplo, agrupemos según la empresa. Esto creará un objeto DataFrameGroupBy:</strong>

In [56]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [59]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [60]:
df.groupby('Company')['Sales'].sum()

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

In [61]:
df.groupby('Company')['Sales'].describe()

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Operaciones

Hay muchas operaciones con pandas que serán realmente útiles para nosotros, por ejemplo:

In [64]:
df = pd.DataFrame({'Col1':[1,2,3,4],'Col2':[444,555,666,444],'Col3':['abc','def','ghi','xyz']})
df

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info de Valores Unicos

In [67]:
df['Col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [68]:
df['Col2'].unique()

array([444, 555, 666], dtype=int64)

In [69]:
df['Col2'].nunique()

3

In [70]:
df['Col2'].value_counts()

Col2
444    2
555    1
666    1
Name: count, dtype: int64

### Seleccionando Datos

In [71]:
df[(df['Col1']>2) & (df['Col2']==444)]

   Col1  Col2 Col3
3     4   444  xyz

### Definiendo y aplicando funciones

In [72]:
df

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [75]:
def time2(x):
    return x**2 + 2*x + 2

In [76]:
df['Col1'].apply(time2)

0     5
1    10
2    17
3    26
Name: Col1, dtype: int64

In [77]:
df['Col4'] = df['Col1'].apply(time2)

In [78]:
df

   Col1  Col2 Col3  Col4
0     1   444  abc     5
1     2   555  def    10
2     3   666  ghi    17
3     4   444  xyz    26

In [79]:
df['Col3'].apply(len)

0    3
1    3
2    3
3    3
Name: Col3, dtype: int64

### Eliminar una columna de forma permanente

In [80]:
del df['Col4']

In [81]:
df

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Obtener nombres de índice y columna:

In [82]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [83]:
df.set_index('Col3', inplace=True)
df

      Col1  Col2
Col3
abc      1   444
def      2   555
ghi      3   666
xyz      4   444

In [84]:
df.index

Index(['abc', 'def', 'ghi', 'xyz'], dtype='object', name='Col3')

### Ordenar un DataFrame:

In [86]:
df.sort_values(by='Çol2', inplace=True)

KeyError: 'Çol2'

In [87]:
help(df.sort_values)

Help on method sort_values in module pandas.core.frame:

sort_values(by: 'IndexLabel', *, axis: 'Axis' = 0, ascending: 'bool | list[bool] | tuple[bool, ...]' = True, inplace: 'bool' = False, kind: 'SortKind' = 'quicksort', na_position: 'str' = 'last', ignore_index: 'bool' = False, key: 'ValueKeyFunc | None' = None) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Sort by the values along either axis.

    Parameters
    ----------
    by : str or list of str
        Name or list of names to sort by.

        - if `axis` is 0 or `'index'` then `by` may contain index
          levels and/or column labels.
        - if `axis` is 1 or `'columns'` then `by` may contain column
          levels and/or index labels.
    axis : "{0 or 'index', 1 or 'columns'}", default 0
         Axis to be sorted.
    ascending : bool or list of bool, default True
         Sort ascending vs. descending. Specify list for multiple sort
         orders.  If this is a list of bools, must match the length of
         the by.
    inplace : bool, default False
         If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
         Choice of sorting algorithm. See also :func:`numpy.sort` for more
         information. `mergesort` and `stable` are the only stable algorithms. For
         DataFrames, this option is only applied when sorting on a single
         column or label.
    na_position : {'first', 'last'}, default 'last'
         Puts NaNs at the beginning if `first`; `last` puts NaNs at the
         end.
    ignore_index : bool, default False
         If True, the resulting axis will be labeled 0, 1, …, n - 1.
    key : callable, optional
        Apply the key function to the values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return a Series with the same shape as the input.
        It will be applied to each column in `by` independently.

    Returns
    -------
    DataFrame or None
        DataFrame with sorted values or None if ``inplace=True``.

    See Also
    --------
    DataFrame.sort_index : Sort a DataFrame by the index.
    Series.sort_values : Similar method for a Series.

    Examples
    --------
    >>> df = pd.DataFrame({
    ...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    ...     'col2': [2, 1, 9, 8, 7, 4],
    ...     'col3': [0, 1, 9, 4, 2, 3],
    ...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
    ... })
    >>> df
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Sort by col1

    >>> df.sort_values(by=['col1'])
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort by multiple columns

    >>> df.sort_values(by=['col1', 'col2'])
      col1  col2  col3 col4
    1    A     1     1    B
    0    A     2     0    a
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort Descending

    >>> df.sort_values(by='col1', ascending=False)
      col1  col2  col3 col4
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B
    3  NaN     8     4    D

    Putting NAs first

    >>> df.sort_values(by='col1', ascending=False, na_position='first')
      col1  col2  col3 col4
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B

    Sorting with a key function

    >>> df.sort_values(by='col4', key=lambda col: col.str.lower())
       col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Natural sort with the key argument,
    using the `natsort <https://github.com/SethMMorton/natsort>` package.

    >>> df = pd.DataFrame({
    ...    "time": ['0hr', '128hr', '72hr', '48hr', '96hr'],
    ...    "value": [10, 20, 30, 40, 50]
    ... })
    >>> df
        time  value
    0    0hr     10
    1  128hr     20
    2   72hr     30
    3   48hr     40
    4   96hr     50
    >>> from natsort import index_natsorted
    >>> df.sort_values(
    ...     by="time",
    ...     key=lambda x: np.argsort(index_natsorted(df["time"]))
    ... )
        time  value
    0    0hr     10
    3   48hr     40
    2   72hr     30
    4   96hr     50
    1  128hr     20

In [89]:
df.sort_values(by='Çol2', inplace=True, ascending=False)

KeyError: 'Çol2'

# Entrada y salida de datos

La librería de pandas permite leer una variedad de tipos de archivos usando sus métodos pd.read_. Echemos un vistazo a los tipos de datos más comunes:

In [91]:
df_bank = pd.read_csv('Data/bank.csv')
df_bank.head()
#Por default muestra 5 elementos pero podemos cambiar el numero de elementos a mostrar en el parametro

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [92]:
df_bank.describe()

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [93]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

## CSV
Los archivos de valores separados por comas (CSV), son archivos de texto que utilizan comas como delimitadores de campo.<br>
### CSV entrada

In [ ]:
#pd.read_csv

In [95]:
df

      Col1  Col2
Col3
abc      1   444
def      2   555
ghi      3   666
xyz      4   444

### CSV salida

In [96]:
df.to_csv('Data/e1.csv')

## Excel
con Pandas podemos leer y escribir archivos de MS Excel. Sin embargo, esto solo importa datos, no fórmulas ni imágenes. Un archivo que contiene imágenes o macros puede causar que el método <tt>.read_excel()</tt> no funcione.

In [97]:
pd.read_excel('Data/Excel2.xlsx')

   Unnamed: 0   b   c   d
0           0   1   2   3
1           1   5   6   7
2           2   9  10  11
3           3  13  14  15

In [98]:
pd.read_excel('Data/Excel2.xlsx', index_col = [0])

    b   c   d
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15